USE AdventureWorksLT2019;
GO

-- Задача 1.1. Получить сведения о клиентах
-- TODO: добавить проверенный запрос студента.

-- Задача 1.2. Получить данные по имени клиента
-- TODO: добавить проверенный запрос студента.

-- Задача 1.3. Получить имена клиентов и номера телефонов
-- TODO: добавить проверенный запрос студента.

-- Задача 2.1. Получить список компаний-клиентов
-- TODO: добавить проверенный запрос студента.

-- Задача 2.2. Получить список изменений заказа клиента
-- TODO: добавить проверенный запрос студента.

-- Задача 3.1. Получить имена контактов с отчествами, если они известны
-- TODO: добавить проверенный запрос студента.

-- Задача 3.2. Получить первичные контактные данные
-- TODO: добавить проверенный запрос студента.
-- Изменение EmailAddress и проверочный SELECT должны выполняться внутри
-- BEGIN TRANSACTION ... ROLLBACK.

-- Задача 3.3. Получить статус доставки
-- TODO: добавить проверенный запрос студента.
-- Изменение ShipDate и проверочный SELECT должны выполняться внутри
-- BEGIN TRANSACTION ... ROLLBACK.
